app/views/auctions/_card.html.erb

      <div style="width:100%;height:100%;background:linear-gradient(<%= rand(0..360) %>deg, #2a2a3e, #1a1a2e);display:flex;align-items:center;justify-content:center;">
        <span style="font-family:var(--font-display);font-size:3rem;opacity:0.2;color:var(--color-accent);"><%= auction.artwork.title.first(2).upcase %></span>
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" IN (?, ?, ?, ?)  [["id", 5], ["id", 15], ["id", 14], ["id", 12]]