app/controllers/artworks_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?, ?)  [["id", 5], ["id", 7], ["id", 4], ["id", 3], ["id", 2]]
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = ? LIMIT ?  [["slug", "digital-art"], ["LIMIT", 1]]
---
    scope = @q.result.includes(:artist, :category, image_attachment: :blob)

    if params[:category].present?
      @category = Category.find_by(slug: params[:category])

SELECT "artworks".* FROM "artworks" WHERE "artworks"."slug" = ? LIMIT ?  [["slug", "whispers-of-light"], ["LIMIT", 1]]
---
  def set_artwork
    @artwork = Artwork.find_by!(slug: params[:id])