app/controllers/auctions_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?)  [["id", 2], ["id", 3], ["id", 7], ["id", 5]]
---
    scope = Auction.includes(artwork: [:artist, :category, { image_attachment: :blob }])

SELECT 1 AS one FROM "bids" WHERE "bids"."auction_id" = ? LIMIT ?  [["auction_id", 8], ["LIMIT", 1]]
SELECT 1 AS one FROM "watchlists" WHERE "watchlists"."user_id" = ? AND "watchlists"."auction_id" = ? LIMIT ?  [["user_id", 8], ["auction_id", 8], ["LIMIT", 1]]
---
  def show
    @artwork = @auction.artwork
    @bids = @auction.bids.includes(:bidder).highest_first.limit(10)
    @bid = Bid.new
    @watching = current_user&.watchlists&.exists?(auction: @auction)

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def set_auction
    @auction = Auction.find(params[:id])