app/controllers/bids_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def set_auction
    @auction = Auction.find(params[:auction_id])