app/controllers/home_controller.rb

  def index
    @featured_artworks = Artwork.published.featured.includes(:artist, :category, image_attachment: :blob).limit(6)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" IN (?, ?, ?, ?)  [["id", 5], ["id", 15], ["id", 14], ["id", 12]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?)  [["id", 1], ["id", 2], ["id", 3], ["id", 4]]