app/models/artwork.rb

SELECT 1 AS one FROM "artworks" WHERE "artworks"."slug" = ? LIMIT ?  [["slug", "crimson-horizon"], ["LIMIT", 1]]
---
  def generate_slug
    base_slug = title.parameterize
    self.slug = base_slug
    counter = 1
    while Artwork.exists?(slug: self.slug)