app/models/auction.rb

INSERT INTO "bids" ("auction_id", "bidder_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["auction_id", 7], ["bidder_id", 8], ["amount", 213.0], ["created_at", "2026-02-06 08:56:57.824806"], ["updated_at", "2026-02-06 08:56:57.824806"]]
---
  def place_bid!(bidder, amount)
    return false if !live?
    return false if bidder == seller
    return false if amount < minimum_bid

    transaction do
      bid = bids.create!(bidder: bidder, amount: amount)